###############################################################
#  Generated by:      Cadence Innovus 21.39-s058_1
#  OS:                Linux x86_64(Host ID eeapps03.labidm.seas.ucla.edu)
#  Generated on:      Wed Feb 18 19:39:02 2026
#  Design:            s1494_bench
#  Command:           saveDesign output/s1494_part1.invs
###############################################################
current_design s1494_bench
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {blif_clk_net}]  -name blif_clk_net -period 1.500000 -waveform {0.000000 0.750000}
set_clock_transition  -rise -min 0.1 [get_clocks {blif_clk_net}]
set_clock_transition  -rise -max 0.1 [get_clocks {blif_clk_net}]
set_clock_transition  -fall -min 0.1 [get_clocks {blif_clk_net}]
set_clock_transition  -fall -max 0.1 [get_clocks {blif_clk_net}]
set_propagated_clock  [get_ports {blif_clk_net}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v2}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {blif_reset_net}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v3}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v4}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {CLR}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v5}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v6}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v0}]
set_input_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v1}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_23}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_16}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_10}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_6}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_24}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_17}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_11}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_7}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_18}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_12}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_8}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_19}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_20}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_13}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_9}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_21}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_14}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_22}]
set_output_delay -add_delay 0 -clock [get_clocks {blif_clk_net}] [get_ports {v13_D_15}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X8}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X32}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X16}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/LOGIC1_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X4}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X2}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/FILLCELL_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/LOGIC0_X1}]
set_dont_use  [get_lib_cells {NangateOpenCellLibrary/ANTENNA_X1}]
